app/controllers/accounts_controller.rb

SELECT COUNT(*) FROM `accounts` WHERE (`accounts`.parent_account_id = 1)
SELECT `accounts`.* FROM `accounts` WHERE (`accounts`.parent_account_id = 1)
---
  def show
    @account = Account.find(params[:id])