app/views/accounts/show.html.haml

SELECT COUNT(*) FROM `accounts` WHERE (`accounts`.parent_account_id = 1)
SELECT `accounts`.* FROM `accounts` WHERE (`accounts`.parent_account_id = 1)
---
    %th Prim H_S Email
  - @account.sub_accounts.each do |account|